tutorials/MultiRegion-OpenFoam-v11-main -case2/MultiRegion-OpenFoam-v11-main/multiRegionTutorial/0/battery1/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/battery1";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    battery1_to_Air
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
